iarsystems/ewarm-toshiba-example-projects/TMPM036/TMPM036-SK/Blinking_LED/M036_CMSIS_header_V2.0.2.1/Libraries/TX00_CMSIS/TMPM036.h
/* WDT */
#define TSB_WD_MOD_RESCR                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_WD->MOD,1)))
#define TSB_WD_MOD_I2WDT                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_WD->MOD,2)))
#define TSB_WD_MOD_WDTE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_WD->MOD,7)))


/* CG */
#define TSB_CG_SYSCR_FPSEL                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->SYSCR,12)))
#define TSB_CG_SYSCR_FCSTOP                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->SYSCR,20)))
#define TSB_CG_OSCCR_WUEON                        (*((__O  uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,0)))
#define TSB_CG_OSCCR_WUEF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,1)))
#define TSB_CG_OSCCR_PLLON                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,2)))
#define TSB_CG_OSCCR_XEN1                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,8)))
#define TSB_CG_OSCCR_OSCF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,9)))
#define TSB_CG_OSCCR_XEN2                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,16)))
#define TSB_CG_OSCCR_OSCSEL                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,17)))
#define TSB_CG_OSCCR_EHOSCSEL                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,18)))
#define TSB_CG_OSCCR_HWUPSEL                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,19)))
#define TSB_CG_PLLSEL_PLLSEL                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->PLLSEL,0)))
#define TSB_CG_PLLSEL_PLLST                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_CG->PLLSEL,18)))
#define TSB_CG_IMCGA_INT0EN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGA,0)))
#define TSB_CG_IMCGA_INT1EN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGA,8)))
#define TSB_CG_IMCGA_INT2EN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGA,16)))
#define TSB_CG_IMCGA_INT3EN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGA,24)))
#define TSB_CG_IMCGB_INT4EN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGB,0)))
#define TSB_CG_IMCGB_INT5EN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGB,8)))
#define TSB_CG_RSTFLG_PONRSTF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->RSTFLG,0)))
#define TSB_CG_RSTFLG_PINRSTF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->RSTFLG,1)))
#define TSB_CG_RSTFLG_WDTRSTF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->RSTFLG,2)))
#define TSB_CG_RSTFLG_SYSRSTF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->RSTFLG,4)))
#define TSB_CG_RSTFLG_LVDRSTF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->RSTFLG,6)))


/* LVD */
#define TSB_LVD_CR1_EN                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_LVD->CR1,0)))
#define TSB_LVD_CR1_INTSEL                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_LVD->CR1,4)))
#define TSB_LVD_CR1_INTEN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_LVD->CR1,5)))
#define TSB_LVD_CR1_RSTEN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_LVD->CR1,6)))
#define TSB_LVD_CR1_ST                            (*((__I  uint32_t *)BITBAND_PERI(&TSB_LVD->CR1,7)))


/* Interrupt Mask and Status Flag register */
#define TSB_INTM_FLG_INTFLG0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTM->FLG,0)))
#define TSB_INTM_FLG_INTFLG1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTM->FLG,1)))
#define TSB_INTM_FLG_INTFLG2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTM->FLG,2)))
#define TSB_INTM_FLG_INTFLG3                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTM->FLG,3)))
#define TSB_INTM_FLG_INTFLG4                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTM->FLG,4)))
#define TSB_INTM_FLG_INTFLG5                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTM->FLG,5)))
#define TSB_INTM_FLG_INTFLG6                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTM->FLG,6)))
#define TSB_INTM_FLG_INTFLG7                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTM->FLG,7)))
#define TSB_INTM_FLG_INTFLG8                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTM->FLG,8)))
#define TSB_INTM_FLG_INTFLG9                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTM->FLG,9)))
#define TSB_INTM_MASK_INTMSK0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTM->MASK,0)))
#define TSB_INTM_MASK_INTMSK1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTM->MASK,1)))
#define TSB_INTM_MASK_INTMSK2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTM->MASK,2)))
#define TSB_INTM_MASK_INTMSK3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTM->MASK,3)))
#define TSB_INTM_MASK_INTMSK4                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTM->MASK,4)))
#define TSB_INTM_MASK_INTMSK5                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTM->MASK,5)))
#define TSB_INTM_MASK_INTMSK6                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTM->MASK,6)))
#define TSB_INTM_MASK_INTMSK7                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTM->MASK,7)))
#define TSB_INTM_MASK_INTMSK8                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTM->MASK,8)))
#define TSB_INTM_MASK_INTMSK9                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTM->MASK,9)))


/* ADC */
#define TSB_AD_MOD1_I2AD                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD1,6)))
#define TSB_AD_MOD1_VREFON                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD1,7)))
#define TSB_AD_MOD3_ADOBSV0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD3,0)))
#define TSB_AD_MOD3_ADOBIC0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD3,5)))
#define TSB_AD_MOD4_ADHTG                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD4,4)))
#define TSB_AD_MOD4_ADHS                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD4,5)))
#define TSB_AD_MOD4_HADHTG                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD4,6)))
#define TSB_AD_MOD4_HADHS                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD4,7)))
#define TSB_AD_MOD5_ADOBSV1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD5,0)))
#define TSB_AD_MOD5_ADOBIC1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD5,5)))
#define TSB_AD_MOD6_ADDMA                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD6,0)))
#define TSB_AD_MOD6_ADHPDMA                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD6,1)))
#define TSB_AD_MOD6_ADM0DMA                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD6,2)))
#define TSB_AD_MOD6_ADM1DMA                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD6,3)))

/** @} */ /* End of group Device_Peripheral_registers */

#ifdef __cplusplus
}
#endif

#endif  /* __TMPM036_H__ */

/** @} */ /* End of group TMPM036 */
/** @} */ /* End of group TOSHIBA_TX00_MICROCONTROLLER */
